---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DetailFailures
source: html/3ccd2646-718d-e38b-4cff-a2e81ce9dc2d.htm
---
# BuiltInFailures.DetailFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.